In [47]:
import numpy as np
import pandas as pd

In [48]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [49]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [50]:
len(df['col2'].unique())

3

In [51]:
df['col2'].nunique() # Igual que len(df['col2'].unique())

3

In [52]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [53]:
df[df['col1'] > 2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [54]:
df[(df['col1'] > 2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [55]:
def times2(x):
    return x*2
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [56]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [57]:
df['col2'].apply(lambda x: x*2) # **** importante ****

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [58]:
df.drop('col1',axis=1) # Recordar si es necesario usar el inplace=True

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [59]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [74]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [76]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [84]:
df.sort_values('col2') # Es lo mismo que df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [86]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [90]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [92]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN